"""
Здесь собраны все константы используемые в игре.

Помимо фиксированных параметров, перечислены показатели отвечающие за логику
и игровой баланс.
"""

# Количество периодов в игре
periods: int = 10


# Группы населения
population_groups = [
    'Социальное обеспечение',
    'Природные ресурсы',
    'Энергоресурсы',
    'Промышленность',
    'Сельское хозяйство',
    'Транспорт',
]

# Группы рабочих
workers_groups = [
    'Все рабочие',
    'Природные ресурсы',
    'Энергоресурсы',
    'Промышленность',
    'Сельское хозяйство',
    'Транспорт',
]
